app/controllers/cheeses_controller.rb

    def index
        render json: Cheese.all
---
SELECT "cheeses".* FROM "cheeses"

     def show
        render json: Cheese.find(params[:id])
---
SELECT "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]