app/controllers/cheese_plates_controller.rb

    def index
        render json: CheesePlate.all
---
SELECT "cheese_plates".* FROM "cheese_plates"

     def show
        render json: CheesePlate.find(params[:id])
---
SELECT "cheese_plates".* FROM "cheese_plates" WHERE "cheese_plates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]