app/controllers/drinks_controller.rb

    def index
        render json: Drink.all
---
SELECT "drinks".* FROM "drinks"

    def show
        render json: Drink.find(params[:id])
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]