app/controllers/pairings_controller.rb

    def index
        render json: Pairing.all
---
SELECT "pairings".* FROM "pairings"

    def show
        render json: Pairing.find(params[:id])
---
SELECT "pairings".* FROM "pairings" WHERE "pairings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]