app/controllers/plates_controller.rb

    def index
        render json: Plate.all
---
SELECT "plates".* FROM "plates"